Series

1D ndarray with an axis label

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.2.4'

In [3]:
population_dict = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}

population_dict

{'California': 38956785,
 'Texas': 26441568,
 'New York': 19555647,
 'Florida': 12364569,
 'Illinois': 12882135}

In [4]:
type(population_dict)

dict

In [5]:
population = pd.Series(population_dict)
population

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [ ]:
type(population)

In [ ]:
population['California']

In [ ]:
population[0]

In [ ]:
population

In [ ]:
population['California':'New York']

In [ ]:
pd.Series([2,4,6,8])

In [ ]:
pd.Series( [2,4,6] , index=[100,200,300] )

In [ ]:
pd.Series( 5 )

In [ ]:
pd.Series( 5 , index=[100,200,300] )

In [ ]:
pd.Series( {2:'a' ,  1:'b', 3:'c'} )

In [ ]:
pd.Series( {2:'a' ,  1:'b', 3:'c'}, index=[3,2,4,5] )

In [ ]:
population

In [ ]:
population.shape # Series

In [ ]:
type(population)

In [ ]:
df = pd.DataFrame(population)
df

In [ ]:
df.shape # DataFrame

In [6]:
df = pd.DataFrame(population, columns=['Population'])
df

            Population
California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135

In [ ]:
data = [ {'a':i, 'b':2*i} for i in range(3) ]
data

In [ ]:
df = pd.DataFrame(data)
df

In [ ]:
df = pd.DataFrame(data, index=['X','Y','Z'])
df

In [ ]:
df = pd.DataFrame(data, index=['X','Y','Z'])
df

In [ ]:
df.columns

In [ ]:
df.columns=['A','B']
df

In [ ]:
df.index = ['m','n','o']
df

In [ ]:
pd.DataFrame( [ {'a':1,'b':2} , {'b':3,'c':4} ] )

In [ ]:
import numpy as np
pd.DataFrame(np.random.rand(3,2), columns=['Class1','Class2'], index=['a','b','c'])

__Indexers: loc and iloc__

In [ ]:
data = pd.Series(['a','b','c'] , index=[1,3,5])
data

In [ ]:
# explicit index when indexing
data[1]

In [ ]:
# data[0]

In [ ]:
# implicit index when slicing
data[1:3]

In [ ]:
data

In [ ]:
data.loc[3]

In [ ]:
data.iloc[0]

In [ ]:
data.loc[1:3]

In [ ]:
data.iloc[1:3] # SI to (EI-1)

__Data Retrieval:__

>1. List of Dictionaries

>2. csv files

>3. Databases

In [ ]:
# List of Dictionaries

d = [ {'city':'Delhi','data':1000}, {'city':'Mumbai','data':2000}, 
     {'city':'Bangalore','data':1500} ]
pd.DataFrame(d)

In [1]:
# csv files
import pandas as pd
import numpy as np


df = pd.read_csv('student_records.csv')
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [ ]:
df = pd.read_csv(r'C:\Users\Ubaid Shah\Downloads\Board Infinity\Python Master File\Darshan Python\student_records.csv')
df

In [2]:
df.head() # 5 rows

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No

In [3]:
df.head(3)

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y             90            85       Yes
1   John            C        N             85            51       Yes
2  David            F        N             10            17        No

In [4]:
df.head(6)

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes

In [5]:
df.tail() # last 5 rows

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [7]:
df.tail(1)

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
7  Trent            C        Y             75            33        No

# Databases

import cx_Oracle

server = 'xxxxxxxx' # Address of the database server
user = 'xxxxxx' # the username for the database server
password = 'xxxxxx' # password for the database server

conn = cxOracle.connect( server=server, user=user, password=password )

query = 'select * from some_table'

df = pd.read_sql( query , conn )

In [8]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [9]:
ser = df.ProjectScore
print(ser)
print(type(ser))
print(ser.shape)

0    85
1    51
2    17
3    71
4    30
5    79
6    59
7    33
Name: ProjectScore, dtype: int64
<class 'pandas.core.series.Series'>
(8,)

In [10]:
df['ProjectScore']

0    85
1    51
2    17
3    71
4    30
5    79
6    59
7    33
Name: ProjectScore, dtype: int64

In [11]:
df.ProjectScore

0    85
1    51
2    17
3    71
4    30
5    79
6    59
7    33
Name: ProjectScore, dtype: int64

In [12]:
df.shape

(8, 6)

In [13]:
df.columns

Index(['Name', 'OverallGrade', 'Obedient', 'ResearchScore', 'ProjectScore',
       'Recommend'],
      dtype='object')

In [14]:
list(df.columns)

['Name',
 'OverallGrade',
 'Obedient',
 'ResearchScore',
 'ProjectScore',
 'Recommend']

In [15]:
# Summary of the numeric columns
df.describe()

       ResearchScore  ProjectScore
count       8.000000      8.000000
mean       63.375000     53.125000
std        31.640559     24.752705
min        10.000000     17.000000
25%        50.000000     32.250000
50%        75.000000     55.000000
75%        86.250000     73.000000
max        92.000000     85.000000

In [16]:
df['ResearchScore'].quantile(0.5)

75.0

In [17]:
df['ResearchScore'].quantile(0.9)

90.6

In [18]:
df['ResearchScore'].mean()

63.375

In [19]:
df['ResearchScore'].count()

8

In [20]:
df.columns # All cols

Index(['Name', 'OverallGrade', 'Obedient', 'ResearchScore', 'ProjectScore',
       'Recommend'],
      dtype='object')

In [21]:
# Numeric cols
df.describe().columns

Index(['ResearchScore', 'ProjectScore'], dtype='object')

In [22]:
df.head(1)

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y             90            85       Yes

In [23]:
x = df.drop('Name',axis=1)
x

  OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0            A        Y             90            85       Yes
1            C        N             85            51       Yes
2            F        N             10            17        No
3            B        Y             75            71        No
4            E        N             20            30        No
5            A        Y             92            79       Yes
6            B        Y             60            59        No
7            C        Y             75            33        No

In [24]:
# Categorical cols
list(set(x.columns) - set(x.describe().columns))

['Recommend', 'OverallGrade', 'Obedient']

In [26]:
cat_col = list(set(x.columns) - set(x.describe().columns))
cat_col

['Recommend', 'OverallGrade', 'Obedient']

In [36]:
x[cat_col]

  Recommend OverallGrade Obedient
0       Yes            A        Y
1       Yes            C        N
2        No            F        N
3        No            B        Y
4        No            E        N
5       Yes            A        Y
6        No            B        Y
7        No            C        Y

In [32]:
df[cat_col]

  Recommend OverallGrade Obedient
0       Yes            A        Y
1       Yes            C        N
2        No            F        N
3        No            B        Y
4        No            E        N
5       Yes            A        Y
6        No            B        Y
7        No            C        Y

In [ ]:
df

In [38]:
df['ResearchScore'] >=80

0     True
1     True
2    False
3    False
4    False
5     True
6    False
7    False
Name: ResearchScore, dtype: bool

In [37]:
# Find the students who have got the research score >=80

df[df['ResearchScore'] >=80]

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y             90            85       Yes
1   John            C        N             85            51       Yes
5  Simon            A        Y             92            79       Yes

In [39]:
# Find the students who have got the research score >=80

df[df['ResearchScore'] >=80]['Name']

0    Henry
1     John
5    Simon
Name: Name, dtype: object

In [42]:
df[df['ResearchScore'] >=80]['Name'].shape[0]

3

In [43]:
df[df['ResearchScore'] >=80]['Name'].shape[0]+47

50

In [44]:
# Find the students who have got the research score >=80

df.where(df.ResearchScore >= 80)

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y           90.0          85.0       Yes
1   John            C        N           85.0          51.0       Yes
2    NaN          NaN      NaN            NaN           NaN       NaN
3    NaN          NaN      NaN            NaN           NaN       NaN
4    NaN          NaN      NaN            NaN           NaN       NaN
5  Simon            A        Y           92.0          79.0       Yes
6    NaN          NaN      NaN            NaN           NaN       NaN
7    NaN          NaN      NaN            NaN           NaN       NaN

In [45]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [47]:
df['Recommend'].unique()

array(['Yes', 'No'], dtype=object)

In [49]:
df['Recommend'].value_counts()

No     5
Yes    3
Name: Recommend, dtype: int64

In [ ]:
df

In [50]:
nparray = df.values
print(nparray)
print(type(nparray))
print(nparray.shape)

[['Henry' 'A' 'Y' 90 85 'Yes']
 ['John' 'C' 'N' 85 51 'Yes']
 ['David' 'F' 'N' 10 17 'No']
 ['Holmes' 'B' 'Y' 75 71 'No']
 ['Marvin' 'E' 'N' 20 30 'No']
 ['Simon' 'A' 'Y' 92 79 'Yes']
 ['Robert' 'B' 'Y' 60 59 'No']
 ['Trent' 'C' 'Y' 75 33 'No']]
<class 'numpy.ndarray'>
(8, 6)

In [51]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [52]:
df['ResearchScore']

0    90
1    85
2    10
3    75
4    20
5    92
6    60
7    75
Name: ResearchScore, dtype: int64

In [53]:
df['ResearchScore'].sum()

507

In [54]:
col_num = df.describe().columns
x = df[col_num]
x

   ResearchScore  ProjectScore
0             90            85
1             85            51
2             10            17
3             75            71
4             20            30
5             92            79
6             60            59
7             75            33

In [55]:
x.sum()

ResearchScore    507
ProjectScore     425
dtype: int64

In [56]:
x.sum(axis=0)

ResearchScore    507
ProjectScore     425
dtype: int64

In [57]:
x.sum(axis=1)

0    175
1    136
2     27
3    146
4     50
5    171
6    119
7    108
dtype: int64

In [58]:
x.mean(axis=0)

ResearchScore    63.375
ProjectScore     53.125
dtype: float64

In [59]:
x.mean(axis=1)

0    87.5
1    68.0
2    13.5
3    73.0
4    25.0
5    85.5
6    59.5
7    54.0
dtype: float64

In [60]:
x.count(axis=0)

ResearchScore    8
ProjectScore     8
dtype: int64

In [61]:
x.count(axis=1)

0    2
1    2
2    2
3    2
4    2
5    2
6    2
7    2
dtype: int64

In [62]:
x

   ResearchScore  ProjectScore
0             90            85
1             85            51
2             10            17
3             75            71
4             20            30
5             92            79
6             60            59
7             75            33

In [63]:
x['TOTAL'] = x['ResearchScore'] + x['ProjectScore']
x

<ipython-input-63-1c7f0f5b8461>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x['TOTAL'] = x['ResearchScore'] + x['ProjectScore']

   ResearchScore  ProjectScore  TOTAL
0             90            85    175
1             85            51    136
2             10            17     27
3             75            71    146
4             20            30     50
5             92            79    171
6             60            59    119
7             75            33    108

In [64]:
x['Mean']=x.mean(axis=1)

<ipython-input-64-66dce48d5955>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x['Mean']=x.mean(axis=1)

In [65]:
x

   ResearchScore  ProjectScore  TOTAL        Mean
0             90            85    175  116.666667
1             85            51    136   90.666667
2             10            17     27   18.000000
3             75            71    146   97.333333
4             20            30     50   33.333333
5             92            79    171  114.000000
6             60            59    119   79.333333
7             75            33    108   72.000000

In [66]:
x['TIMEPASS'] = 9999
x

<ipython-input-66-881f1365b0f6>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x['TIMEPASS'] = 9999

   ResearchScore  ProjectScore  TOTAL        Mean  TIMEPASS
0             90            85    175  116.666667      9999
1             85            51    136   90.666667      9999
2             10            17     27   18.000000      9999
3             75            71    146   97.333333      9999
4             20            30     50   33.333333      9999
5             92            79    171  114.000000      9999
6             60            59    119   79.333333      9999
7             75            33    108   72.000000      9999